Revit 2027 API
SelectionFilterElement.SetElementIds Method
 Replaces the set of ElementIds contained by this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetElementIds(
	ICollection<ElementId> ids
)
Public Sub SetElementIds (
	ids As ICollection(Of ElementId)
)
public:
void SetElementIds(
	ICollection<ElementId^>^ ids
)
member SetElementIds :
        ids : ICollection<ElementId> -> unit
Parameters
ids ICollection<ElementId>
 The new set of ElementIds.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace